leihen0525/Master.BSP.S32K1xx/S32K1xx/S32K1xx.LPI2C.h
/*
 * S32K1xx.LPI2C.h
 *
 *  Created on: 2020年7月20日
 *      Author: Master.HE
 */

#ifndef S32K1XX_LPI2C_H_
#define S32K1XX_LPI2C_H_

#include "S32K1xx.Type.h"


typedef union
{
	__I  uint32_t DATA;
	struct
	{
		__I  uint32_t FEATURE							:16;
		__I  uint32_t MINOR								:8;
		__I  uint32_t MAJOR								:8;
	}BIT;
}LPI2C_VERID_Type;

typedef union
{
	__I  uint32_t DATA;
	struct
	{
		__I  uint32_t MTXFIFO							:4;
		__I  uint32_t									:4;

		__I  uint32_t MRXFIFO							:4;
		__I  uint32_t									:4;

		__I  uint32_t									:16;
	}BIT;
}LPI2C_PARAM_Type;

typedef union
{
	__IO uint32_t DATA;
	struct
	{
		__IO uint32_t MEN								:1;
		__IO uint32_t RST								:1;
		__IO uint32_t DOZEN								:1;
		__IO uint32_t DBGEN								:1;
		__IO uint32_t									:4;

		__IO uint32_t RTF								:1;
		__IO uint32_t RRF								:1;
		__IO uint32_t									:6;

		__IO uint32_t									:16;
	}BIT;
}LPI2C_MCR_Type;

typedef union
{
	__IO uint32_t DATA;
	struct
	{
		__IO uint32_t TDF								:1;
		__IO uint32_t RDF								:1;
		__IO uint32_t									:6;

		__IO uint32_t EPF								:1;
		__IO uint32_t SDF								:1;
		__IO uint32_t NDF								:1;
		__IO uint32_t ALF								:1;
		__IO uint32_t FEF								:1;
		__IO uint32_t PLTF								:1;
		__IO uint32_t DMF								:1;
		__IO uint32_t									:1;

		__IO uint32_t									:8;

		__IO uint32_t MBF								:1;
		__IO uint32_t BBF								:1;
		__IO uint32_t									:6;
	}BIT;
}LPI2C_MSR_Type;

typedef union
{
	__IO uint32_t DATA;
	struct
	{
		__IO uint32_t TDIE								:1;
		__IO uint32_t RDIE								:1;
		__IO uint32_t									:6;

		__IO uint32_t EPIE								:1;
		__IO uint32_t SDIE								:1;
		__IO uint32_t NDIE								:1;
		__IO uint32_t ALIE								:1;
		__IO uint32_t FEIE								:1;
		__IO uint32_t PLTIE								:1;
		__IO uint32_t DMIE								:1;
		__IO uint32_t									:1;

		__IO uint32_t									:16;
	}BIT;
}LPI2C_MIER_Type;

typedef union
{
	__IO uint32_t DATA;
	struct
	{
		__IO uint32_t TDDE								:1;
		__IO uint32_t RDDE								:1;
		__IO uint32_t									:30;
	}BIT;
}LPI2C_MDER_Type;

typedef union
{
	__IO uint32_t DATA;
	struct
	{
		__IO uint32_t HREN								:1;
		__IO uint32_t HRPOL								:1;
		__IO uint32_t HRSEL								:1;
		__IO uint32_t									:5;

		__IO uint32_t CIRFIFO							:1;
		__IO uint32_t RDMO								:1;
		__IO uint32_t									:6;

		__IO uint32_t									:16;
	}BIT;
}LPI2C_MCFGR0_Type;

typedef union
{
	__IO uint32_t DATA;
	struct
	{
		__IO uint32_t PRESCALE							:3;
		__IO uint32_t									:5;

		__IO uint32_t AUTOSTOP							:1;
		__IO uint32_t IGNACK							:1;
		__IO uint32_t TIMECFG							:1;
		__IO uint32_t									:5;

		__IO uint32_t MATCFG							:3;
		__IO uint32_t									:5;

		__IO uint32_t PINCFG							:3;
		__IO uint32_t									:1;
		__IO uint32_t									:4;
	}BIT;
}LPI2C_MCFGR1_Type;

typedef union
{
	__IO uint32_t DATA;
	struct
	{
		__IO uint32_t BUSIDLE							:12;
		__IO uint32_t									:4;

		__IO uint32_t FILTSCL							:4;
		__IO uint32_t									:4;

		__IO uint32_t FILTSDA							:4;
		__IO uint32_t									:4;
	}BIT;
}LPI2C_MCFGR2_Type;

typedef union
{
	__IO uint32_t DATA;
	struct
	{
		__IO uint32_t									:8;

		__IO uint32_t PINLOW							:12;
		__IO uint32_t									:4;

		__IO uint32_t									:8;
	}BIT;
}LPI2C_MCFGR3_Type;

typedef union
{
	__IO uint32_t DATA;
	struct
	{
		__IO uint32_t MATCH0							:8;

		__IO uint32_t									:8;

		__IO uint32_t MATCH1							:8;

		__IO uint32_t									:8;
	}BIT;
}LPI2C_MDMR_Type;

typedef union
{
	__IO uint32_t DATA;
	struct
	{
		__IO uint32_t CLKLO								:6;
		__IO uint32_t									:2;

		__IO uint32_t CLKHI								:6;
		__IO uint32_t									:2;

		__IO uint32_t SETHOLD							:6;
		__IO uint32_t									:2;

		__IO uint32_t DATAVD							:6;
		__IO uint32_t									:2;
	}BIT;
}LPI2C_MCCR0_Type;

typedef union
{
	__IO uint32_t DATA;
	struct
	{
		__IO uint32_t CLKLO								:6;
		__IO uint32_t									:2;

		__IO uint32_t CLKHI								:6;
		__IO uint32_t									:2;

		__IO uint32_t SETHOLD							:6;
		__IO uint32_t									:2;

		__IO uint32_t DATAVD							:6;
		__IO uint32_t									:2;
	}BIT;
}LPI2C_MCCR1_Type;

typedef union
{
	__IO uint32_t DATA;
	struct
	{
		__IO uint32_t TXWATER							:2;
		__IO uint32_t									:14;

		__IO uint32_t RXWATER							:2;
		__IO uint32_t									:14;
	}BIT;
}LPI2C_MFCR_Type;

typedef union
{
	__I  uint32_t DATA;
	struct
	{
		__I  uint32_t TXCOUNT							:3;
		__I  uint32_t									:13;

		__I  uint32_t RXCOUNT							:3;
		__I  uint32_t									:13;
	}BIT;
}LPI2C_MFSR_Type;

typedef union
{
	__IO uint32_t DATA;
	struct
	{
		__IO uint32_t DATA								:8;

		__IO uint32_t CMD								:3;
		__IO uint32_t									:5;

		__IO uint32_t									:16;
	}BIT;
}LPI2C_MTDR_Type;

typedef union
{
	__I  uint32_t DATA;
	struct
	{
		__I  uint32_t DATA								:8;

		__I  uint32_t									:6;
		__I  uint32_t RXEMPTY							:1;
		__I  uint32_t									:1;

		__I  uint32_t									:16;
	}BIT;
}LPI2C_MRDR_Type;

typedef union
{
	__IO uint32_t DATA;
	struct
	{
		__IO uint32_t SEN								:1;
		__IO uint32_t RST								:1;
		__IO uint32_t									:2;
		__IO uint32_t FILTEN							:1;
		__IO uint32_t FILTDZ							:1;
		__IO uint32_t									:2;

		__IO uint32_t RTF								:1;
		__IO uint32_t RRF								:1;
		__IO uint32_t									:6;

		__IO uint32_t									:16;
	}BIT;
}LPI2C_SCR_Type;

typedef union
{
	__IO uint32_t DATA;
	struct
	{
		__IO uint32_t TDF								:1;
		__IO uint32_t RDF								:1;
		__IO uint32_t AVF								:1;
		__IO uint32_t TAF								:1;
		__IO uint32_t									:4;

		__IO uint32_t RSF								:1;
		__IO uint32_t SDF								:1;
		__IO uint32_t BEF								:1;
		__IO uint32_t FEF								:1;
		__IO uint32_t AM0F								:1;
		__IO uint32_t AM1F								:1;
		__IO uint32_t GCF								:1;
		__IO uint32_t SARF								:1;

		__IO uint32_t									:8;

