leihen0525/Master.BSP.S32K1xx/S32K1xx/S32K1xx.LPI2C.h
		__IO uint32_t SBF								:1;
		__IO uint32_t BBF								:1;
		__IO uint32_t									:6;
	}BIT;
}LPI2C_SSR_Type;

typedef union
{
	__IO uint32_t DATA;
	struct
	{
		__IO uint32_t TDIE								:1;
		__IO uint32_t RDIE								:1;
		__IO uint32_t AVIE								:1;
		__IO uint32_t TAIE								:1;
		__IO uint32_t									:4;

		__IO uint32_t RSIE								:1;
		__IO uint32_t SDIE								:1;
		__IO uint32_t BEIE								:1;
		__IO uint32_t FEIE								:1;
		__IO uint32_t AM0IE								:1;
		__IO uint32_t AM1F								:1;
		__IO uint32_t GCIE								:1;
		__IO uint32_t SARIE								:1;

		__IO uint32_t									:16;
	}BIT;
}LPI2C_SIER_Type;

typedef union
{
	__IO uint32_t DATA;
	struct
	{
		__IO uint32_t TDDE								:1;
		__IO uint32_t RDDE								:1;
		__IO uint32_t AVDE								:1;
		__IO uint32_t									:29;
	}BIT;
}LPI2C_SDER_Type;

typedef union
{
	__IO uint32_t DATA;
	struct
	{
		__IO uint32_t ADRSTALL							:1;
		__IO uint32_t RXSTALL							:1;
		__IO uint32_t TXDSTALL							:1;
		__IO uint32_t ACKSTALL							:1;
		__IO uint32_t									:4;

		__IO uint32_t GCEN								:1;
		__IO uint32_t SAEN								:1;
		__IO uint32_t TXCFG								:1;
		__IO uint32_t RXCFG								:1;
		__IO uint32_t IGNACK							:1;
		__IO uint32_t HSMEN								:1;
		__IO uint32_t									:2;

		__IO uint32_t ADDRCFG							:3;
		__IO uint32_t									:13;
	}BIT;
}LPI2C_SCFGR1_Type;

typedef union
{
	__IO uint32_t DATA;
	struct
	{
		__IO uint32_t CLKHOLD							:4;
		__IO uint32_t									:4;

		__IO uint32_t DATAVD							:6;
		__IO uint32_t									:2;

		__IO uint32_t FILTSCL							:4;
		__IO uint32_t									:4;

		__IO uint32_t FILTSDA							:4;
		__IO uint32_t									:4;
	}BIT;
}LPI2C_SCFGR2_Type;

typedef union
{
	__IO uint32_t DATA;
	struct
	{
		__IO uint32_t									:1;
		__IO uint32_t ADDR0								:10;
		__IO uint32_t									:5;

		__IO uint32_t									:1;
		__IO uint32_t ADDR1								:10;
		__IO uint32_t									:5;
	}BIT;
}LPI2C_SAMR_Type;

typedef union
{
	__I  uint32_t DATA;
	struct
	{
		__I  uint32_t RADDR								:11;
		__I  uint32_t									:3;
		__I  uint32_t ANV								:1;
		__I  uint32_t									:1;

		__I  uint32_t									:16;
	}BIT;
}LPI2C_SASR_Type;

typedef union
{
	__IO uint32_t DATA;
	struct
	{
		__IO uint32_t TXNACK							:1;
		__IO uint32_t									:31;
	}BIT;
}LPI2C_STAR_Type;

typedef union
{
	__IO uint32_t DATA;
	struct
	{
		__IO uint32_t data								:8;
		__IO uint32_t									:24;
	}BIT;
}LPI2C_STDR_Type;

typedef union
{
	__I  uint32_t DATA;
	struct
	{
		__I  uint32_t data								:8;

		__I  uint32_t									:6;
		__I  uint32_t RXEMPTY							:1;
		__I  uint32_t SOF								:1;

		__I  uint32_t									:16;
	}BIT;
}LPI2C_SRDR_Type;
/* ----------------------------------------------------------------------------
   -- LPI2C Peripheral Access Layer
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup LPI2C_Peripheral_Access_Layer LPI2C Peripheral Access Layer
 * @{
 */


/** LPI2C - Size of Registers Arrays */

/** LPI2C - Register Layout Typedef */
typedef struct {
	LPI2C_VERID_Type VERID;                             /**< Version ID Register, offset: 0x0 */
	LPI2C_PARAM_Type PARAM;                             /**< Parameter Register, offset: 0x4 */
	uint8_t RESERVED_0[8];
	LPI2C_MCR_Type MCR;                               /**< Master Control Register, offset: 0x10 */
	LPI2C_MSR_Type MSR;                               /**< Master Status Register, offset: 0x14 */
	LPI2C_MIER_Type MIER;                              /**< Master Interrupt Enable Register, offset: 0x18 */
	LPI2C_MDER_Type MDER;                              /**< Master DMA Enable Register, offset: 0x1C */
	LPI2C_MCFGR0_Type MCFGR0;                            /**< Master Configuration Register 0, offset: 0x20 */
	LPI2C_MCFGR1_Type MCFGR1;                            /**< Master Configuration Register 1, offset: 0x24 */
	LPI2C_MCFGR2_Type MCFGR2;                            /**< Master Configuration Register 2, offset: 0x28 */
	LPI2C_MCFGR3_Type MCFGR3;                            /**< Master Configuration Register 3, offset: 0x2C */
	uint8_t RESERVED_1[16];
	LPI2C_MDMR_Type MDMR;                              /**< Master Data Match Register, offset: 0x40 */
	uint8_t RESERVED_2[4];
	LPI2C_MCCR0_Type MCCR0;                             /**< Master Clock Configuration Register 0, offset: 0x48 */
	uint8_t RESERVED_3[4];
	LPI2C_MCCR1_Type MCCR1;                             /**< Master Clock Configuration Register 1, offset: 0x50 */
	uint8_t RESERVED_4[4];
	LPI2C_MFCR_Type MFCR;                              /**< Master FIFO Control Register, offset: 0x58 */
	LPI2C_MFSR_Type MFSR;                              /**< Master FIFO Status Register, offset: 0x5C */
	LPI2C_MTDR_Type MTDR;                              /**< Master Transmit Data Register, offset: 0x60 */
	uint8_t RESERVED_5[12];
	LPI2C_MRDR_Type MRDR;                              /**< Master Receive Data Register, offset: 0x70 */

	uint8_t RESERVED_6[156];

	LPI2C_SCR_Type SCR;                               /**< Slave Control Register, offset: 0x110 */
	LPI2C_SSR_Type SSR;                               /**< Slave Status Register, offset: 0x114 */
	LPI2C_SIER_Type SIER;                              /**< Slave Interrupt Enable Register, offset: 0x118 */
	LPI2C_SDER_Type SDER;                              /**< Slave DMA Enable Register, offset: 0x11C */
	uint8_t RESERVED_7[4];
	LPI2C_SCFGR1_Type SCFGR1;                            /**< Slave Configuration Register 1, offset: 0x124 */
	LPI2C_SCFGR2_Type SCFGR2;                            /**< Slave Configuration Register 2, offset: 0x128 */
	uint8_t RESERVED_8[20];
	LPI2C_SAMR_Type SAMR;                              /**< Slave Address Match Register, offset: 0x140 */
	uint8_t RESERVED_9[12];
	LPI2C_SASR_Type SASR;                              /**< Slave Address Status Register, offset: 0x150 */
	LPI2C_STAR_Type STAR;                              /**< Slave Transmit ACK Register, offset: 0x154 */
	uint8_t RESERVED_10[8];
	LPI2C_STDR_Type STDR;                              /**< Slave Transmit Data Register, offset: 0x160 */
	uint8_t RESERVED_11[12];
	LPI2C_SRDR_Type SRDR;                              /**< Slave Receive Data Register, offset: 0x170 */
} LPI2C_Type, *LPI2C_MemMapPtr;

 /** Number of instances of the LPI2C module. */
#if (defined (__Target_S32K116__) || defined (__Target_S32K118__) || defined (__Target_S32K142__) || defined (__Target_S32K144__) || defined (__Target_S32K146__))
#define LPI2C_INSTANCE_COUNT                     (1u)
#elif (defined (__Target_S32K148__))
#define LPI2C_INSTANCE_COUNT                     (2u)
#endif

/* LPI2C - Peripheral instance base addresses */
/** Peripheral LPI2C0 base address */
#define LPI2C0_BASE                              (0x40066000u)
/** Peripheral LPI2C0 base pointer */
#define LPI2C0                                   ((LPI2C_Type *)LPI2C0_BASE)

